Revit 2027 API
ElementPhaseStatusFilter(ElementId, ICollection<ElementOnPhaseStatus>) Constructor
 Constructs a new instance of a file to match elements that have a given phase statuses on the input phase.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementPhaseStatusFilter(
	ElementId phaseId,
	ICollection<ElementOnPhaseStatus> phaseStatuses
)
Public Sub New (
	phaseId As ElementId,
	phaseStatuses As ICollection(Of ElementOnPhaseStatus)
)
public:
ElementPhaseStatusFilter(
	ElementId^ phaseId,
	ICollection<ElementOnPhaseStatus>^ phaseStatuses
)
new :
        phaseId : ElementId *
        phaseStatuses : ICollection<ElementOnPhaseStatus> -> ElementPhaseStatusFilter
Parameters
phaseId ElementId
 Id of the phase.
phaseStatuses ICollection<ElementOnPhaseStatus>
 Target statuses.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ElementPhaseStatusFilter Class
ElementPhaseStatusFilter Overload
Autodesk.Revit.DB Namespace